# STEP 5: ETL the data from 3NF tables to Facts & Dimension Tables
**IMPORTANT:** The following exercise depends on first having successing completed Exercise 1: Step 4. 

Start by running the code in the cell below to connect to the database. If you are coming back to this exercise, then uncomment and run the first cell to recreate the database. If you recently completed steps 1 through 4, then skip to the second cell.

In [1]:
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'postgres'
DB_PASSWORD = 'xxxxx'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)

postgresql://postgres:Met/14/7472@127.0.0.1:5432/pagila

In [2]:
%sql $conn_string

### Introducing SQL to SQL ETL
When writing SQL to SQL ETL, you first create a table then use the INSERT and SELECT statements together to populate the table. Here's a simple example.

First, you create a table called test_table.

In [3]:
%%sql
CREATE TABLE test_table
(
    date timestamp,
    revenue decimal(5,2)
);

 * postgresql://postgres:***@127.0.0.1:5432/pagila
Done.

[]

Then you use the INSERT and SELECT statements to populate the table. In this case, the SELECT statement extracts data from the `payment` table and INSERTs it INTO the `test_table`.

In [4]:
%%sql
INSERT INTO test_table (date, revenue)
SELECT payment_date AS date, 
        amount AS revenue
FROM payment;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
16049 rows affected.

[]

Then you can use a SELECT statement to take a look at the new table.

In [5]:
%sql SELECT * FROM test_table LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(datetime.datetime(2020, 1, 24, 22, 40, 19, 996577), Decimal('1.99')),
 (datetime.datetime(2020, 1, 25, 16, 16, 50, 996577), Decimal('0.99')),
 (datetime.datetime(2020, 1, 28, 22, 44, 14, 996577), Decimal('6.99')),
 (datetime.datetime(2020, 1, 29, 1, 58, 2, 996577), Decimal('0.99')),
 (datetime.datetime(2020, 1, 29, 9, 10, 6, 996577), Decimal('4.99'))]

In [6]:
%sql DROP TABLE test_table;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
Done.

[]

Great! Now you'll do the same thing below to create the dimension and fact tables for the Star Schema using the data in the 3NF database.

## ETL from 3NF to Star Schema

In [ ]:
%%sql
INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)